
{
  "title":"Syllabus",
  "content":"A list of topics covered in the course is presented in the calendar.\nCourse Meeting Times Lectures: 2 sessions / week, 1.5 hours / session\nPrerequisites Besides general mathematical maturity, the minimal suggested requirements for the course are the following: Linear Algebra (e.g., 18.06 / 18.700), a background course on Linear Optimization or Convex Analysis (e.g., 6.251J or 6.255 / 15.093, 6.253), Basic Probability (e.g., 6.041 / 6.431). Familiarity with the basic elements of Modern Algebra (e.g., groups, rings, fields) is encouraged. Knowledge of the essentials of Dynamical Systems and Control (e.g., 6.241) is recommended, but not required.\nBibliography We will use a variety of book chapters and current papers. Some of these are listed in the readings section.\nGrading The final grade will be calculated based on the following weights:\nACTIVITIES PERCENTAGES Research Project 50% Homework 25% Scribe Notes 25% Homework Problem sets will be handed out in an approximately biweekly basis and will be due one week later, at the beginning of the lecture on their respective due dates. We expect you to turn in all completed problem sets on time. Late homework will not be accepted, unless there is a prior arrangement with the instructor.\nScribe Work Each student will also be responsible for editing and/or writing lecture notes from two lectures.\nCollaboration Policy We encourage working together whenever possible: in the tutorials, on the problem sets, and during general discussion of the material and assignments. Keep in mind, however, that the problem set solutions you hand in should reflect your own understanding of the class material. It is not acceptable to copy a solution that somebody else has written.\nCalendar LEC # TOPICS KEY DATES 1 Introduction\nReview of Convexity and Linear Programming 2 PSD Matrices\nSemidefinite Programming 3 Binary Optimization\nBounds: Goemans-Williamson and Nesterov\nLinearly Constrained Problems 4 Review: Groups, Rings, Fields\nPolynomials and Ideals 5 Univariate Polynomials\nRoot Bounds and Sturm Sequences\nCounting Real Roots\nNonnegativity\nSum of Squares\nPositive Semidefinite Matrices Homework 1 out 6 Resultants\nDiscriminants\nApplications\nThe set of Nonnegative Polynomials 7 Hyperbolic Polynomials\nSDP Representability Homework 1 due 8 SDP Representability\nConvex Sets in R2 \\n \\nHyperbolicity and the Lax Conjecture\nRelating SDP-representable Sets and Hyperbolic Polynomials\nCharacterization 9 Binomial Equations\nNewton Polytopes\nThe Bézout and BKK Bounds\nApplication: Nash Equilibria 10 Nonegativity and Sums of Squares\nSums of Squares and Semidefinite Programming\nApplications and Extensions\nMultivariate Polynomials\nDuality and Density 11 SOS Applications\nMoments\nBridging the Gap 12 Recovering a Measure from its Moments\nA Probabilistic Interpretation\nDuality and Complementary Slackness\nMultivariate Case\nDensity Results 13 Polynomial Ideals\nAlgebraic Varieties\nQuotient Rings\nMonomial Orderings Homework 2 out 14 Monomial Orderings\nGröbner Bases\nApplications and Examples\nZero-dimensional Ideals Homework 2 due 15 Zero-dimensional Ideals\nHilbert Series 16 Generalizing the Hermite Matrix\nParametric Versions\nSOS on Quotients 17 Infeasibility of Real Polynomial Equations\nCertificates\nThe Zero-dimensional Case\nOptimization 18 Quantifier Elimination\nTarski-Seidenberg\nCylindrical Algebraic Decomposition (CAD) 19 Certificates\nPsatz Revisited\nCopositive Matrices and Pólya\u0026rsquo;s Theorem\nPositive Polynomials 20 Positive Polynomials\nSchmüdgen\u0026rsquo;s Theorem 21 Groups and their Representations\nAlgebra Decomposition Homework 3 out 22 Sums of Squares Programs and Polynomial Inequalities Homework 3 due three days after Lec #22 "}


