
{
  "title":"Readings",
  "content":" Suggested Texts Cox, D. A., John B. Little, and Donal O\u0026rsquo;Shea. Ideals, Varieties, and Algorithms: An Introduction to Computational Algebraic Geometry and Commutative Algebra. New York, NY: Springer-Verlag, 1997. ISBN: 0387946802.\nde Klerk, Etienne. Aspects of Semidefinite Programming: Interior Point Algorithms and Selected Applications. Boston, MA: Kluwer Academic Publishers, 2002. ISBN: 1402005474.\nMishra, Bhubaneswar. Algorithmic Algebra. New York, NY: Springer-Verlag, 1993. ISBN: 0387940901.\nSturmfels, Bernd. Solving Systems of Polynomial Equations. Providence, RI: American Mathematical Society, 2002. ISBN: 0821832514.\nWolkowicz, Henry, Romesh Saigal, and Lieven Vandenberghe, eds. Handbook of Semidefinite Programming. Boston, MA: Kluwer Academic Publishers, 2000. ISBN: 0792377710.\nYap, Chee-Keng. Fundamental Problems of Algorithmic Algebra. New York, NY: Oxford University Press, 2000. ISBN: 0195125169.\nReadings by Session LEC # TOPICS READINGS 1 Introduction\nReview of Convexity and Linear Programming Bertsekas, Dimitri P., Angelia Nedic, and Asuman E. Ozdaglar. Convex Analysis and Optimization. Belmont, MA: Athena Scientific, 2003. ISBN: 1886529450.\nBertsimas, Dimitris, and John N. Tsitsiklis. Introduction to Linear Optimization. Belmont, MA: Athena Scientific, 1997. ISBN: 1886529191.\nBen-Tal, A., and Arkadii S. Nemirovskii. Lectures on Modern Convex Optimization: Analysis, Algorithms, and Engineering Applications. MPS/SIAM Series on Optimization. Philadelphia, PA: Society for Industrial and Applied Mathematics (SIAM), 2001. ISBN: 0898714915.\nBoyd, Steven, and Lieven Vandenberghe. Convex Optimization. New York, NY: Cambridge University Press, 2004. ISBN: 0521833787.\nRockafellar, R. Tyrrell. Convex Analysis. Princeton, NJ: Princeton University Press, Princeton, 1970. ISBN: 0691080690.\nZiegler, Günter M. Lectures on Polytopes. Vol. 152 of Graduate Texts in Mathematics. New York, NY: Springer-Verlag, 1995. ISBN: 0387943293. 2 PSD Matrices\nSemidefinite Programming Boyd, Steven, and Lieven Vandenberghe. Convex Optimization. New York, NY: Cambridge University Press, 2004. ISBN: 0521833787.\nLovász, L. \u0026ldquo;On the Shannon Capacity of a Graph.\u0026rdquo; IEEE Transactions on Information Theory 25, no. 1 (1979): 1-7.\nRamana, M. V. \u0026ldquo;An Exact Duality Theory for Semidefinite Programming and its Complexity Implications.\u0026rdquo; Math Programming 77, no. 2, Ser. B (1997): 129-162.\nRamana, M. V., L. Tunçel, and H. Wolkowicz. \u0026ldquo;Strong Duality for Semidefinite Programming.\u0026rdquo; SIAM J Optim 7, no. 3 (1997): 641-662. 3 Binary Optimization\nBounds: Goemans-Williamson and Nesterov\nLinearly Constrained Problems Ben-Tal, A., and Arkadii S. Nemirovskii. Lectures on Modern Convex Optimization: Analysis, Algorithms, and Engineering Applications. MPS/SIAM Series on Optimization. Philadelphia, PA: Society for Industrial and Applied Mathematics (SIAM), 2001. ISBN: 0898714915.\nGarey, M. R., and D. S. Johnson. Computers and Intractability: A Guide to the Theory of NP-completeness. New York, NY: W. H. Freeman and Company, 1979. ISBN: 0716710447.\nGoemans, M. X., and D. P. Williamson. \u0026ldquo;Improved Approximation Algorithms for Maximum Cut and Satisfiability Problems Using Semidefinite Programming.\u0026rdquo; Journal of the ACM 42, no. 6 (1995): 1115-1145.\nMegretski, A. \u0026ldquo;Relaxations of Quadratic Programs in Operator Theory and System Analysis.\u0026rdquo; In Systems, Approximation, Singular Integral Operators, and Related Topics (Bordeaux, 2000). Edited by Alexander A. Borichev and N. K. Nikolski. Vol. 129 of Operator Theory Advances and Applications. Boston, MA: Birkhäuser Verlag, 2001, pp. 365-392. ISBN: 3764366451. 4 Review: Groups, Rings, Fields\nPolynomials and Ideals Bochnak, J., M. Coste, and M.-F. Roy. Real Algebraic Geometry. New York, NY: Springer, 1998. ISBN: 3540646639.\nCox, D. A., J. B. Little, and D. O\u0026rsquo;Shea. Ideals, Varieties, and Algorithms: An Introduction to Computational Algebraic Geometry and Commutative Algebra. New York, NY: Springer, 1997. ISBN: 0387946802.\nDummit, David S., and Richard M. Foote. Abstract Algebra. Englewood Cliffs, NJ: Prentice Hall, 1991. ISBN: 0130047716.\nLang, Serge. Algebra. Reading, MA: Addison-Wesley, 1971. ISBN: 0201041774. 5 Univariate Polynomials\nRoot Bounds and Sturm Sequences\nCounting Real Roots\nNonnegativity\nSum of Squares\nPositive Semidefinite Matrices Basu, S., R. Pollack, and M.-F. Roy. Algorithms in Real Algebraic Geometry (Algorithms and Computation in Mathematics). Vol. 10. New York, NY: Springer-Verlag, 2003. ISBN: 3540009736.\nHorn, Roger A., and Charles R. Johnson. Matrix Analysis. Cambridge, UK: Cambridge University Press, 1995. ISBN: 0521305861. 6 Resultants\nDiscriminants\nApplications\nThe set of Nonnegative Polynomials Andradas, C. \u0026ldquo;Characterization and description of basic semialgebraic sets.\u0026rdquo; In Algorithmic and Quantitative Real Algebraic Geometry (Piscataway, NJ, 2001). Edited by Basu, Saugata and Laureano Gonzalez Vega. DIMACS Ser Discrete Math Theoret Comput Sci, 60. Providence, RI: American Mathematical Society, 2003. pp. 1-12. ISBN: 0821828630.\nCox, D. A., J. B. Little, and D. O\u0026rsquo;Shea. Ideals, Varieties, and Algorithms: An Introduction to Computational Algebraic Geometry and Commutative Algebra. New York, NY: Springer, 1997. ISBN: 0387946802.\nFaybusovich, L. \u0026ldquo;Self-concordant Barriers for Cones Generated by Chebyshev Systems.\u0026rdquo; SIAM J Optim 12, no. 3 (2002): 770-781.\nKao, C. Y., and A. Megretski. \u0026ldquo;A New Barrier Function for IQC Optimization Problems.\u0026rdquo; In Proceedings of the American Control Conference. Piscataway, NJ: IEEE, 2002. ISBN: 0780372980.\nRamana, M., and A. J. Goldman. \u0026ldquo;Some Geometric Results in Semidefinite Programming.\u0026rdquo; J Global Optim 7, no.1 (1995): 33-50.\nSturmfels, B. \u0026ldquo;Introduction to Resultants.\u0026rdquo; In Applications of Computational Algebraic Geometry (San Diego, CA, 1997). Edited by David A. Cox, Bernd Sturmfels, and Dinesh N. Manocha. Vol. 53. Proc Sympos Appl Math. Providence, RI: American Mathematical Society, 1998, pp. 25-39. ISBN: 0821807501. 7 Hyperbolic Polynomials\nSDP Representability Bauschke, H. H., O. Güler, A. S. Lewis, and H. S. Sendov. \u0026ldquo;Hyperbolic polynomials and convex analysis.\u0026rdquo; Canad J Math 53, no. 3 (2001): 470-488.\nBoyd, Steven, and Lieven Vandenberghe. Convex Optimization. New York, NY: Cambridge University Press, 2004. ISBN: 0521833787.\nGårding, L. \u0026ldquo;An Inequality for Hyperbolic Polynomials.\u0026rdquo; J Math Mech 8 (1959): 957-965.\nGüler, O. \u0026ldquo;Hyperbolic polynomials and interior point methods for convex programming.\u0026rdquo; Math Oper Res 22, no. 2 (1997): 350-377.\nNesterov, Y. E., and A. Nemirovski. Interior-Point Polynomial Methods in Convex Programming. Vol. 13. Studies in Applied Mathematics. Philadelphia, PA: SIAM, 1994. ISBN: 0898713196.\nRenegar, J. \u0026ldquo;Hyperbolic Programs, and Their Derivative Relaxations.\u0026rdquo; Preprint, 2005. 8 SDP Representability\nConvex Sets in R2 \\n \\nHyperbolicity and the Lax Conjecture\nRelating SDP-representable Sets and Hyperbolic Polynomials\nCharacterization Helton, J. W., and V. Vinnikov. Linear Matrix Inequality Representation of Sets. Preprint.\nLax, P. D. \u0026ldquo;Differential equations, Difference Equations, and Matrix Theory.\u0026rdquo; Comm Pure Appl Math 11 (1958): 175-194.\nLewis, A. S., P. A. Parrilo, and M. V. Ramana. \u0026ldquo;The Lax Conjecture is True.\u0026rdquo; Proc Amer Math Soc 133, no. 9 (2005): 2495-2499. 9 Binomial Equations\nNewton Polytopes\nThe Bézout and BKK Bounds\nApplication: Nash Equilibria Sturmfels, B. Solving Systems of Polynomial Equations. Providence, RI: American Mathematical Society, 2002. ISBN: 0821832514. 10 Nonegativity and Sums of Squares\nSums of Squares and Semidefinite Programming\nApplications and Extensions\nMultivariate Polynomials\nDuality and Density Reznick, B. \u0026ldquo;Extremal PSD Forms With Few Terms.\u0026rdquo; Duke Mathematical Journal 45, no. 2 (1978): 363-374.\nReznick, B. \u0026ldquo;Some Concrete Aspects of Hilbert\u0026rsquo;s 17th Problem.\u0026rdquo; In Real Algebraic Geometry and Ordered Structures. Edited by Charles N. Delzell, and James J. Madden. Vol. 253. Contemporary Mathematics. Providence, RI: American Mathematical Society, 2000, pp. 251-272. ISBN: 0821808044. 11 SOS Applications\nMoments\nBridging the Gap Parrilo, P. A. \u0026ldquo;Structured Semidefinite Programs and Semialgebraic Geometry Methods in Robustness and Optimization.\u0026rdquo; PhD diss., California Institute of Technology, May 2000.\nPapachristodoulou, A., and S. Prajna. \u0026ldquo;On the Construction of Lyapunov Functions Using the Sum of Squares Decomposition.\u0026rdquo; In Proceedings of the 41st IEEE Conference on Decision and Control. New York, NY: IEEE, 2002. ISSN: 07431546.\nPrajna, S., A. Papachristodoulou, and P. A. Parrilo. SOSTOOLS: Sum of Squares Optimization Toolbox for MATLAB®, 2002-05. Available from SOSTOOLS and SOSTOOLS. 12 Recovering a Measure from its Moments\nA Probabilistic Interpretation\nDuality and Complementary Slackness\nMultivariate Case\nDensity Results Blekherman, G. \u0026ldquo;There are Significantly More Nonnegative Polynomials Than Sums of Squares.\u0026rdquo; Preprint, 2004.\nLasserre, J. B. \u0026ldquo;Global Optimization With Polynomials and the Problem of Moments.\u0026rdquo; SIAM J Optim 11, no. 3 (2001): 796-817. 13 Polynomial Ideals\nAlgebraic Varieties\nQuotient Rings\nMonomial Orderings Cox, D. A., J. B. Little, and D. O\u0026rsquo;Shea. Ideals, Varieties, and Algorithms: An Introduction to Computational Algebraic Geometry and Commutative Algebra. New York, NY: Springer, 1997. ISBN: 0387946802. 14 Monomial Orderings\nGröbner Bases\nApplications and Examples\nZero-dimensional Ideals Adams, William W., and Philippe Loustaunau. An Introduction to Gröbner Bases. Vol. 3. Graduate Studies in Mathematics. Providence, RI: American Mathematical Society, 1994. ISBN: 0821838040.\nBecker, Thomas, and Volker Weispfenning. Gröbner Bases. Vol. 141. Graduate Texts in Mathematics. New York, NY: Springer-Verlag, 1993. ISBN: 0387979719.\nCox, D. A., J. B. Little, and D. O\u0026rsquo;Shea. Ideals, Varieties, and Algorithms: An Introduction to Computational Algebraic Geometry and Commutative Algebra. New York, NY: Springer, 1997. ISBN: 0387946802.\nCoCoATeam. \u0026ldquo;CoCoA: A System for Doing Computations in Commutative Algebra.\u0026rdquo;\nGreuel, G.-M., G. Pfister, and H. Schönemann. \u0026ldquo;Singular 3.0.\u0026rdquo; A Computer Algebra System for Polynomial Computations, Centre for Computer Algebra, University of Kaiserslautern, 2005.\nGrayson, D. R., and M. E. Stillman. \u0026ldquo;Macaulay 2.\u0026rdquo; A Software System for Research in Algebraic Geometry.\nKreuzer, Martin, and Lorenzo Robbiano. Computational Commutative Algebra 1. Berlin, Germany: Springer-Verlag, 2000. ISBN: 354067733X. 15 Zero-dimensional Ideals\nHilbert Series Conti, P., and C. Traverso. \u0026ldquo;Buchberger Algorithm and Integer Programming.\u0026rdquo; In Applied Algebra, Algebraic Algorithms and Error-correcting Codes: 9th International Symposium (New Orleans, LA, 1991). Edited by H. F. Mattson, Teo Mora, and T. R. N. Rao. Lecture Notes in Computer Science, 539. New York, NY: Springer-Verlag, 1991, pp. 130-139. ISBN: 0387545220.\nSturmfels, B., and R. R. Thomas. \u0026ldquo;Variation of Cost Functions in Integer Programming.\u0026rdquo; Math Programming 77 Ser. A, no. 3 (1997): 357-387.\nThomas, R., and R. Weismantel. \u0026ldquo;Truncated Gröbner Bases for Integer Programming.\u0026rdquo; Appl Algebra Engrg Comm Comput 8, no. 4 (1997): 241-256. 16 Generalizing the Hermite Matrix\nParametric Versions\nSOS on Quotients Parrilo, P. A. An Explicit Construction of Distinguished Representations of Polynomials Nonnegative Over Finite Sets. IfA Technical Report AUT02-02, March 2002. ETH Zürich, 2002. (PDF) 17 Infeasibility of Real Polynomial Equations\nCertificates\nThe Zero-dimensional Case\nOptimization Davis, M. \u0026ldquo;Hilbert\u0026rsquo;s Tenth Problem is Unsolvable.\u0026rdquo; Amer Math Monthly 80 (1973): 233-269.\nJeroslow, R. G. \u0026ldquo;There Cannot Be Any Algorithm for Integer Programming With Quadratic Constraints.\u0026rdquo; Operations Res 21 (1973): 221-224.\nParrilo, P. A. An Explicit Construction of Distinguished Representations of Polynomials Nonnegative Over Finite Sets. IfA Technical Report AUT02-02, March 2002. ETH Zürich, 2002. (PDF) 18 Quantifier Elimination\nTarski-Seidenberg\nCylindrical Algebraic Decomposition (CAD) Anderson, B. D. O., N. K. Bose, and E. I. Jury. \u0026ldquo;Output Feedback Stabilization and Related Problems-Solution Via Decision Methods.\u0026rdquo; IEEE Transactions on Automatic Control 20 (1975): 53-66.\nBlondel, Vincent, and M. Gevers. \u0026ldquo;Simultaneous Stabilizability of Three Linear Systems is Rationally Undecidable.\u0026rdquo; Mathematics of Control, Signals, and Systems 6, no. 2 (1993): 135-145.\nBlondel, Vincent. Simultaneous Stabilization of Linear Systems. Lecture Notes in Control and Information Sciences, 191. New York, NY: Springer-Verlag, 1994. ISBN: 0387198628.\nBasu, Saugata, Richard Pollack, and M.-F. Roy. Algorithms in Real Algebraic Geometry. Vol. 10. Algorithms and Computation in Mathematics. New York, NY: Springer-Verlag, 2003. ISBN: 3540009736.\nBrown, C. W. QEPCAD - Quantifier Elimination by Partial Cylindrical Algebraic Decomposition, 2003.\nCaviness, Bob F., and J. R. Johnson, eds. Quantifier Elimination and Cylindrical Algebraic Decomposition (Texts and Monographs in Symbolic Computation). New York, NY: Springer-Verlag, 1998. ISBN: 3211827943.\nCollins, G. E. \u0026ldquo;Quantifier Elimination for Real Closed Fields by Cylindrical Algebraic Decomposition.\u0026rdquo; In Automata Theory and Formal Languages (Second GI Conf, Kaiserslautern, 1975). Edited by H. Brakhage. Lecture Notes in Computer Science, 33. New York, NY: Springer-Verlag, 1975, pp. 134-183. ISBN: 0387074074.\nRenegar, J. \u0026ldquo;Recent Progress on the Complexity of the Decision Problem for the Reals.\u0026rdquo; In Discrete and Computational Geometry (New Brunswick, NJ, 1989/1990). Edited by Goodman, Jacob, Richard D. Pollack, and William L. Steiger. DIMACS Ser Discrete Math Theoret Comput Sci, 6. Providence, RI: American Mathematical Society, 1991, pp. 287-308. ISBN: 0821865951. 19 Certificates\nPsatz Revisited\nCopositive Matrices and Pólya\u0026rsquo;s Theorem\nPositive Polynomials Bochnak, J., M. Coste, and M.-F. Roy. Real Algebraic Geometry. New York, NY: Springer, 1998. ISBN: 3540646639.\nKumar, P. R., and S. P. Meyn. \u0026ldquo;Duality and Linear Programs for Stability and Performance Analysis of Queuing Networks and Scheduling Policies.\u0026rdquo; IEEE Trans Automat Control 41, no. 1 (1996): 4-17.\nMarshall, M. Positive Polynomials and Sums of Squares. Dottorato de Ricerca in Matematica. Dept di Mat, Univ Pisa, 2000.\nParrilo, P. A. \u0026ldquo;Structured Semidefinite Programs and Semialgebraic Geometry Methods in Robustness and Optimization.\u0026rdquo; PhD diss, California Institute of Technology, May 2000.\nPrestel, A., and C. N. Delzell. Positive Polynomials: From Hilbert\u0026rsquo;s 17th Problem to Real Algebra. Springer Monographs in Mathematics. New York, NY: Springer, 2001. ISBN: 3540412158.\nSchmüdgen, K. \u0026ldquo;The K-moment Problem for Compact Semialgebraic Sets.\u0026rdquo; Math Ann 289 (1991): 203-206. 20 Positive Polynomials\nSchmüdgen\u0026rsquo;s Theorem Berg, Christian, Jens P. R. Christensen, and Paul Ressel. Harmonic Analysis on Semigroups: Theory of Positive Definite and Related Functions. Graduate Texts in Mathematics, 100. New York, NY: Springer-Verlag, 1984. ISBN: 0387909257.\nBochnak, J., M. Coste, and M.-F. Roy. Real Algebraic Geometry. New York, NY: Springer-Verlag, 1998. ISBN: 3540646639.\nLasserre, J. B. \u0026ldquo;Global optimization with polynomials and the problem of moments.\u0026rdquo; SIAM J Optim 11, no. 3 (2001): 796-817.\nMarshall, M. Positive Polynomials and Sums of Squares. Dottorato de Ricerca in Matematica. Dept di Mat, Univ Pisa, 2000.\nMegretski, A. \u0026ldquo;Positivity of Trigonometric Polynomials.\u0026rdquo; In Proceedings of the 42nd IEEE Conference on Decision and Control (2003): 3814-3817. ISSN: 07431546.\nParrilo, P. A. \u0026ldquo;Structured Semidefinite Programs and Semialgebraic Geometry Methods in Robustness and Optimization.\u0026rdquo; PhD diss., California Institute of Technology, May 2000.\n———. \u0026ldquo;Semidefinite Programming Relaxations for Semialgebraic problems.\u0026rdquo; Math Prog 96 Ser. B, no. 2 (2003): 293-320.\nPrestel, A., and C. N. Delzell. Positive Polynomials: From Hilbert\u0026rsquo;s 17th Problem to Real Algebra. Springer Monographs in Mathematics. New York, NY: Springer-Verlag, 2001. ISBN: 3540412158.\nPutinar, M. \u0026ldquo;Positive Polynomials on Compact Semi-algebraic Sets.\u0026rdquo; Indiana Univ Math J 42, no. 3 (1993): 969-984.\nRudin, Walter. Fourier Analysis on Groups. Wiley Classics Library. New York, NY: John Wiley \u0026amp; Sons Inc., 1990. ISBN: 047152364X.\nSchmüdgen, K. \u0026ldquo;The K-moment Problem for Compact Semialgebraic Sets.\u0026rdquo; Math Ann 289 (1991): 203-206.\nStengle, G. \u0026ldquo;Complexity Estimates for the Schmüdgen Positivstellensatz.\u0026rdquo; J Complexity 12, no. 2 (1996): 167-174. 21 Groups and their Representations\nAlgebra Decomposition Boyd, S., P. Diaconis, P. A. Parrilo, and L. Xiao. \u0026ldquo;Symmetry Analysis of Reversible Markov Chains.\u0026rdquo; Internet Math 2, no. 1 (2005): 31-71.\nde Klerk, E., J. Maharry, D.V. Pasechnik, R. B. Richter, and G. Salazar. \u0026ldquo;Improved Bounds for the Crossing Numbers of K_m,n and K_n.\u0026rdquo; SIAM J. Discr. Math. 20, (2006): 189-202.\nFässler, Albert, and Eduard Stiefel. Group Theoretical Methods and Their Applications. Boston, MA: Birkhäuser, 1992. ISBN: 0817635270.\nGatermann, K., and P. A. Parrilo. \u0026ldquo;Symmetry Groups, Semidefinite Programs, and Sums of Squares.\u0026rdquo; Journal of Pure and Applied Algebra 192, nos. 1-3 (2004): 95-128.\nParrilo, P. A., and R. Peretz. \u0026ldquo;An Inequality for Circle Packings Proved by Semidefinite Programming.\u0026rdquo; Discrete and Computational Geometry 31, no. 3 (2004): 357-367.\nSchrijver, A. \u0026ldquo;New Code Upper Bounds From the Terwilliger Algebra and Semidefinite Programming.\u0026rdquo; IEEE Transactions on Information Theory 51, no. 8 (2005): 2859-2866.\nSerre, J.-P. Linear Representations of Finite Groups. New York, NY: Springer-Verlag, 1977. ISBN: 0387901906. 22 Sums of Squares Programs and Polynomial Inequalities Parrilo, P. A. \u0026ldquo;Sums of Squares Programs and Polynomial Inequalities.\u0026rdquo; Preprint. "}


